{
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "auto_map": {
	                  "AutoModelForCausalLM": "modeling_gpt_neox_dijiang.GPTNeoXForCausalLM",
			                      "AutoModelForSequenceClassification": "modeling_gpt_neox_dijiang.GPTNeoXForSequenceClassification"
  },
  "bos_token_id": 0,
  "eos_token_id": 0,
  "hidden_act": "gelu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_attention_heads": 8,
  "num_hidden_layers": 16,
  "rotary_emb_base": 10000,
  "rotary_pct": 0.25,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.24.0",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 50304,
  "hidden_dropout": 0,
  "attention_dropout": 0,
  "rope_scaling": null
}
